-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE\output\construct_intangibles.log
  log type:  text
 opened on:   2 Dec 2025, 16:46:17

. 
. di "=========================================="
==========================================

. di "CONSTRUCTING INTANGIBLE CAPITAL"
CONSTRUCTING INTANGIBLE CAPITAL

. di "Date: `c(current_date)'"
Date:  2 Dec 2025

. di "=========================================="
==========================================

. 
. /*==============================================================================
>    STEP 1: LOAD DATA AND MERGE DEFLATORS
> ==============================================================================*/
. 
. di _newline(2)




. di "STEP 1: Loading merged dataset and deflators..."
STEP 1: Loading merged dataset and deflators...

. 
. use "final_data_2011_2022.dta", clear

. local n_start = _N

. di "  Observations in merged dataset: `n_start'"
  Observations in merged dataset: 3105677

. 
. * Merge deflators
. merge m:1 ano using "$rootdir/input/deflators.dta", keep(match master)
(note: variable ano was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         3,105,677  (_merge==3)
    -----------------------------------------

. 
. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
            matched (3) |  3,105,677      100.00      100.00
------------------------+-----------------------------------
                  Total |  3,105,677      100.00

. count if _merge != 3
  0

. if r(N) > 0 {
.     di "  WARNING: " r(N) " observations without deflators"
. }

. drop _merge

. 
. * Verify deflators exist
. count if gdp_deflator == .
  0

. if r(N) > 0 {
.     di "  ERROR: Missing GDP deflator for " r(N) " observations"
.     exit
. }

. 
. di "  → Deflators merged successfully"
  → Deflators merged successfully

. 
. /*==============================================================================
>    STEP 2: DEFLATE ALL VARIABLES
> ==============================================================================*/
. 
. di _newline(2)




. di "STEP 2: Deflating variables to real 2020 prices..."
STEP 2: Deflating variables to real 2020 prices...

. di "  Base year: 2020 (deflators = 100)"
  Base year: 2020 (deflators = 100)

. 
. *------------------------------------------------------------------------------
. * A. DEFLATE REVENUE AND SALES (GDP deflator)
. *------------------------------------------------------------------------------
. di "  A. Revenue and sales..."
  A. Revenue and sales...

. 
. foreach var in SV500101 SD000002 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gdp_deflator) * 100
  5.         label var `var'_real "`var' (real, 2020 prices)"
  6.     }
  7. }
(201,355 missing values generated)
(754,299 missing values generated)

. 
. *------------------------------------------------------------------------------
. * B. DEFLATE COST VARIABLES (GDP deflator)
. *------------------------------------------------------------------------------
. di "  B. Cost variables..."
  B. Cost variables...

. 
. foreach var in SV500601 SV500801 SD000102 SV602500 SV602700 SV603900 ///
>                SV804000 SV804100 SV804200 SV804400 SV804600 SV804700 ///
>                SV804800 SV806700 SV807100 SV569305 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gdp_deflator) * 100
  5.         label var `var'_real "`var' (real, 2020 prices)"
  6.     }
  7. }
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)

. 
. *------------------------------------------------------------------------------
. * C. DEFLATE RESULT VARIABLES (GDP deflator)
. *------------------------------------------------------------------------------
. di "  C. Result variables (profits, EBITDA, etc.)..."
  C. Result variables (profits, EBITDA, etc.)...

. 
. foreach var in SV501701 SV501801 SV502001 SV502201 SD000011 SD000012 ///
>                SD000014 SD000016 SD000018 SD000019 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gdp_deflator) * 100
  5.         label var `var'_real "`var' (real, 2020 prices)"
  6.     }
  7. }
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)

. 
. *------------------------------------------------------------------------------
. * D. DEFLATE INVESTMENT FLOWS (GFCF deflator)
. *------------------------------------------------------------------------------
. di "  D. Investment flows..."
  D. Investment flows...

. 
. foreach var in SD000031 SD000032 SD000036 SD000037 SD000038 SD000113 ///
>                SD000046 SD000047 SD000118 SD000119 SD000120 SD000121 ///
>                SD000122 SD000123 SD000124 SD000125 SD000126 SD000127 ///
>                SD000128 SD557602 SD557603 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gfcf_deflator) * 100
  5.         label var `var'_real "`var' (real, 2020 prices)"
  6.     }
  7. }
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)

. 
. *------------------------------------------------------------------------------
. * E. DEFLATE DISINVESTMENT FLOWS (GFCF deflator)
. *------------------------------------------------------------------------------
. di "  E. Disinvestment flows..."
  E. Disinvestment flows...

. 
. foreach var in SV558201 SD558202 SD558203 SD558204 SV558205 SD563301 ///
>                SD563302 SD563303 SD563304 SD563305 SD563306 SV563307 ///
>                SD000044 SD000115 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gfcf_deflator) * 100
  5.         label var `var'_real "`var' (real, 2020 prices)"
  6.     }
  7. }
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)

. 
. *------------------------------------------------------------------------------
. * F. DEFLATE R&D EXPENDITURES (GDP deflator)
. *------------------------------------------------------------------------------
. di "  F. R&D expenditures..."
  F. R&D expenditures...

. 
. cap confirm variable IM_RND_EXPN

. if _rc == 0 {
.     gen RD_real = (IM_RND_EXPN / gdp_deflator) * 100
(201,355 missing values generated)
.     label var RD_real "R&D expenditures (real, 2020 prices)"
.     di "    → RD_real created from IM_RND_EXPN"
    → RD_real created from IM_RND_EXPN
. }

. else {
.     di "    WARNING: IM_RND_EXPN not found - R&D capital cannot be constructed"
. }

. 
. *------------------------------------------------------------------------------
. * G. DEFLATE BALANCE SHEET VARIABLES (Capital deflator)
. *------------------------------------------------------------------------------
. di "  G. Balance sheet variables (assets, liabilities, equity)..."
  G. Balance sheet variables (assets, liabilities, equity)...

. 
. foreach var in SV510101 SV510201 SV510301 SV510401 SV511201 SV512501 ///
>                SV512601 SV512701 SD000005 SV514101 SV514701 SV515901 ///
>                SV516001 SV516101 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / capital_deflator) * 100
  5.         label var `var'_real "`var' (real, 2020 prices)"
  6.     }
  7. }
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)
(754,299 missing values generated)

. 
. *------------------------------------------------------------------------------
. * H. DEFLATE WAGES (GDP deflator)
. *------------------------------------------------------------------------------
. di "  H. Wages from QP..."
  H. Wages from QP...

. 
. foreach var in avg_wage_all avg_wage_skilled avg_wage_unskilled {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gdp_deflator) * 100
  5.         label var `var'_real "`var' (real, 2020 prices)"
  6.     }
  7. }
(2,195,747 missing values generated)
(182,771 missing values generated)

. 
. di "  → All variables deflated successfully"
  → All variables deflated successfully

. 
. /*==============================================================================
>    STEP 3: CONSTRUCT INTANGIBLE CAPITAL STOCKS
> ==============================================================================*/
. 
. di _newline(2)




. di "=========================================="
==========================================

. di "CONSTRUCTING INTANGIBLE CAPITAL STOCKS"
CONSTRUCTING INTANGIBLE CAPITAL STOCKS

. di "=========================================="
==========================================

. di "Method: Perpetual Inventory Method (PIM)"
Method: Perpetual Inventory Method (PIM)

. di "Following Peters & Taylor (2017)"
Following Peters & Taylor (2017)

. di ""


. di "Parameters:"
Parameters:

. di "  - Knowledge capital (R&D): δ = 15%"
  - Knowledge capital (R&D): δ = 15%

. di "  - Organization capital (SG&A): δ = 20%"
  - Organization capital (SG&A): δ = 20%

. di "  - Initial stocks: K_0 = 0"
  - Initial stocks: K_0 = 0

. di "=========================================="
==========================================

. 
. * Sort panel data
. sort firm_id ano

. xtset firm_id ano
       panel variable:  firm_id (unbalanced)
        time variable:  ano, 2011 to 2022, but with gaps
                delta:  1 unit

. 
. *------------------------------------------------------------------------------
. * STEP 3A: Create SG&A Investment Measure
. *------------------------------------------------------------------------------
. di _newline



. di "STEP 3A: Creating SG&A investment measure..."
STEP 3A: Creating SG&A investment measure...

. di "  SG&A = Advertising (SV804400) + Training (SV603900)"
  SG&A = Advertising (SV804400) + Training (SV603900)

. 
. * Generate SG&A investment = Advertising + Training (both in real terms)
. gen SGA_inv_real = 0

. 
. * Add advertising if available
. cap confirm variable SV804400_real

. if _rc == 0 {
.     replace SGA_inv_real = SV804400_real if SV804400_real != .
(1,071,453 real changes made)
.     di "    → Added advertising (SV804400_real)"
    → Added advertising (SV804400_real)
. }

. else {
.     di "    WARNING: SV804400 not found - advertising excluded from SG&A"
. }

. 
. * Add training if available
. cap confirm variable SV603900_real

. if _rc == 0 {
.     replace SGA_inv_real = SGA_inv_real + SV603900_real if SV603900_real != .
(274,188 real changes made)
.     di "    → Added training (SV603900_real)"
    → Added training (SV603900_real)
. }

. else {
.     di "    WARNING: SV603900 not found - training excluded from SG&A"
. }

. 
. * Set to missing if both components are missing
. replace SGA_inv_real = . if SV804400_real == . & SV603900_real == .
(754,299 real changes made, 754,299 to missing)

. 
. label var SGA_inv_real "SG&A (Advertising + Training, real 2020 prices)"

. 
. sum SGA_inv_real, d

       SG&A (Advertising + Training, real 2020 prices)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs           2,351,378
25%            0              0       Sum of Wgt.   2,351,378

50%            0                      Mean           14529.91
                        Largest       Std. Dev.      431412.3
75%     600.2211       7.43e+07
90%     4000.258       8.01e+07       Variance       1.86e+11
95%     12675.89       8.28e+07       Skewness        85.2655
99%     117644.1       1.00e+08       Kurtosis       9863.051

. di "    → SG&A investment summary:"
    → SG&A investment summary:

. di "       Mean:   " %12.0f r(mean)
       Mean:          14530

. di "       Median: " %12.0f r(p50)
       Median:            0

. di "       N:      " r(N)
       N:      2351378

. 
. *------------------------------------------------------------------------------
. * STEP 3B: Construct Knowledge Capital Stock (from R&D)
. *------------------------------------------------------------------------------
. di _newline



. di "STEP 3B: Constructing Knowledge Capital (from R&D)..."
STEP 3B: Constructing Knowledge Capital (from R&D)...

. di "  Formula: K_t = (1 - δ) × K_{t-1} + I_t"
  Formula: K_t = (1 - δ) × K_{t-1} + I_t

. di "  where δ = 0.15, I_t = RD_real"
  where δ = 0.15, I_t = RD_real

. 
. cap confirm variable RD_real

. if _rc == 0 {
.     * Set R&D to zero if missing (standard approach)
.     gen RD_flow = RD_real
(201,355 missing values generated)
.     replace RD_flow = 0 if RD_flow == .
(201,355 real changes made)
.     
.     * Generate Knowledge Capital stock
.     gen K_knowledge = 0
.     by firm_id: replace K_knowledge = 0 if _n == 1  // Initial stock = 0
(0 real changes made)
.     
.     * Apply perpetual inventory method
.     * δ_R&D = 0.15 → (1-δ) = 0.85
.     by firm_id: replace K_knowledge = 0.85 * K_knowledge[_n-1] + RD_flow if _n > 1
(44023 real changes made)
.     
.     label var K_knowledge "Knowledge capital stock (from R&D, real 2020 prices)"
.     
.     sum K_knowledge, d

        Knowledge capital stock (from R&D, real 2020
                           prices)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs           3,105,677
25%            0              0       Sum of Wgt.   3,105,677

50%            0                      Mean           15425.77
                        Largest       Std. Dev.      841504.8
75%            0       3.03e+08
90%            0       3.05e+08       Variance       7.08e+11
95%            0       3.05e+08       Skewness       213.2924
99%     64324.13       3.13e+08       Kurtosis        60598.7
.     di "    → Knowledge capital constructed:"
    → Knowledge capital constructed:
.     di "       Mean:   " %12.0f r(mean)
       Mean:          15426
.     di "       Median: " %12.0f r(p50)
       Median:            0
.     di "       Max:    " %12.0f r(max)
       Max:       313277952
.     di "       N:      " r(N)
       N:      3105677
. }

. else {
.     gen K_knowledge = .
.     di "    WARNING: Cannot construct knowledge capital - RD_real not available"
. }

. 
. *------------------------------------------------------------------------------
. * STEP 3C: Construct Organization Capital Stock (from SG&A)
. *------------------------------------------------------------------------------
. di _newline



. di "STEP 3C: Constructing Organization Capital (from SG&A)..."
STEP 3C: Constructing Organization Capital (from SG&A)...

. di "  Formula: K_t = (1 - δ) × K_{t-1} + I_t"
  Formula: K_t = (1 - δ) × K_{t-1} + I_t

. di "  where δ = 0.20, I_t = SGA_inv_real"
  where δ = 0.20, I_t = SGA_inv_real

. 
. * Set SG&A investment to zero if missing
. gen SGA_flow = SGA_inv_real
(754,299 missing values generated)

. replace SGA_flow = 0 if SGA_flow == .
(754,299 real changes made)

. 
. * Generate Organization Capital stock
. gen K_org = 0

. by firm_id: replace K_org = 0 if _n == 1  // Initial stock = 0
(0 real changes made)

. 
. * Apply perpetual inventory method
. * δ_SGA = 0.20 → (1-δ) = 0.80
. by firm_id: replace K_org = 0.80 * K_org[_n-1] + SGA_flow if _n > 1
(1425244 real changes made)

. 
. label var K_org "Organization capital stock (from SG&A, real 2020 prices)"

. 
. sum K_org, d

      Organization capital stock (from SG&A, real 2020
                           prices)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs           3,105,677
25%            0              0       Sum of Wgt.   3,105,677

50%            0                      Mean           31782.38
                        Largest       Std. Dev.       1223385
75%     770.6217       2.58e+08
90%     6249.393       2.75e+08       Variance       1.50e+12
95%     20878.84       2.89e+08       Skewness        111.543
99%     222985.9       3.06e+08       Kurtosis          16372

. di "    → Organization capital constructed:"
    → Organization capital constructed:

. di "       Mean:   " %12.0f r(mean)
       Mean:          31782

. di "       Median: " %12.0f r(p50)
       Median:            0

. di "       Max:    " %12.0f r(max)
       Max:       306430592

. di "       N:      " r(N)
       N:      3105677

. 
. *------------------------------------------------------------------------------
. * STEP 3D: Create Total Intangible Capital
. *------------------------------------------------------------------------------
. di _newline



. di "STEP 3D: Creating total intangible capital..."
STEP 3D: Creating total intangible capital...

. 
. * Internally created intangible capital
. gen K_intangible_internal = K_knowledge + K_org

. label var K_intangible_internal "Internally created intangible capital (real 2020 prices)"

. 
. * Add balance sheet intangibles (externally acquired)
. * Note: SV510401_real is already deflated with capital deflator
. cap confirm variable SV510401_real

. if _rc == 0 {
.     gen K_intangible_external = SV510401_real
(754,299 missing values generated)
.     replace K_intangible_external = 0 if K_intangible_external == .
(754,299 real changes made)
.     label var K_intangible_external "Balance sheet intangibles (real 2020 prices)"
.     di "    → Added balance sheet intangibles (SV510401_real)"
    → Added balance sheet intangibles (SV510401_real)
. }

. else {
.     gen K_intangible_external = 0
.     label var K_intangible_external "Balance sheet intangibles (real 2020 prices)"
.     di "    WARNING: SV510401 not found - balance sheet intangibles set to 0"
. }

. 
. * Total intangible capital
. gen K_intangible_total = K_intangible_internal + K_intangible_external

. label var K_intangible_total "Total intangible capital (real 2020 prices)"

. 
. sum K_intangible_total, d

         Total intangible capital (real 2020 prices)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0       -1837307
 5%            0       -1765217
10%            0      -399010.2       Obs           3,105,677
25%            0        -304449       Sum of Wgt.   3,105,677

50%            0                      Mean           179177.6
                        Largest       Std. Dev.      1.27e+07
75%     1371.802       3.45e+09
90%     13375.14       3.67e+09       Variance       1.61e+14
95%     53155.21       3.79e+09       Skewness       186.5685
99%     744206.8       3.83e+09       Kurtosis       41534.85

. di "    → Total intangible capital:"
    → Total intangible capital:

. di "       Mean:   " %12.0f r(mean)
       Mean:         179178

. di "       Median: " %12.0f r(p50)
       Median:            0

. di "       Max:    " %12.0f r(max)
       Max:      3832522496

. 
. *------------------------------------------------------------------------------
. * STEP 3E: Create Total Capital
. *------------------------------------------------------------------------------
. di _newline



. di "STEP 3E: Creating capital aggregates..."
STEP 3E: Creating capital aggregates...

. 
. * Physical capital (use real value)
. cap confirm variable SV512701_real

. if _rc == 0 {
.     gen K_physical = SV512701_real
(754,299 missing values generated)
.     replace K_physical = 0 if K_physical == .
(754,299 real changes made)
.     label var K_physical "Physical capital stock (real 2020 prices)"
. }

. else {
.     gen K_physical = 0
.     label var K_physical "Physical capital stock (real 2020 prices)"
.     di "    WARNING: SV512701 not found - physical capital set to 0"
. }

. 
. * Total capital
. gen K_total = K_physical + K_intangible_total

. label var K_total "Total capital (Physical + Intangible, real 2020 prices)"

. 
. di "    → Capital aggregates"
    → Capital aggregates

. 
. /*==============================================================================
>    STEP 4: SAVE ENHANCED DATASET
> ==============================================================================*/
. 
. di _newline(2)




. di "STEP 5: Saving dataset with intangible capital..."
STEP 5: Saving dataset with intangible capital...

. 
. compress
  variable ano was float now int
  (6,211,354 bytes saved)

. save "final_data_2011_2022_intangibles.dta", replace
file final_data_2011_2022_intangibles.dta saved

. 
. local n_final = _N

. di "  → Dataset saved: final_data_2011_2022_intangibles.dta"
  → Dataset saved: final_data_2011_2022_intangibles.dta

. di "    Observations: `n_final'"
    Observations: 3105677

. 
. /*==============================================================================
>    COMPLETION MESSAGE
> ==============================================================================*/
. 
. di _newline(2)




. di "=========================================="
==========================================

. di "INTANGIBLE CAPITAL CONSTRUCTION COMPLETE"
INTANGIBLE CAPITAL CONSTRUCTION COMPLETE

. di "=========================================="
==========================================

. di ""


. di "Output file:"
Output file:

. di "  → final_data_2011_2022_intangibles.dta"
  → final_data_2011_2022_intangibles.dta

. di ""


. di "Key variables created:"
Key variables created:

. di "  • K_knowledge           - Knowledge capital (from R&D)"
  • K_knowledge           - Knowledge capital (from R&D)

. di "  • K_org                 - Organization capital (from SG&A)"
  • K_org                 - Organization capital (from SG&A)

. di "  • K_intangible_total    - Total intangible capital"
  • K_intangible_total    - Total intangible capital

. di "  • K_physical            - Physical capital"
  • K_physical            - Physical capital

. di "  • K_total               - Total capital"
  • K_total               - Total capital

. di "  • All original variables with '_real' suffix"
  • All original variables with '_real' suffix

. di ""


. di "Next step:"
Next step:

. di "  → Run data_clean_final.do for cleaning and winsorization"
  → Run data_clean_final.do for cleaning and winsorization

. di "=========================================="
==========================================

. 
. cap log close
