------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE\output\construct_intangibles.log
  log type:  text
 opened on:  15 Dec 2025, 16:33:25

. 
. di "=========================================="
==========================================

. di "CONSTRUCTING INTANGIBLE CAPITAL"
CONSTRUCTING INTANGIBLE CAPITAL

. di "=========================================="
==========================================

. di "Date: `c(current_date)'"
Date: 15 Dec 2025

. di ""


. di "Method: Perpetual Inventory Method (PIM)"
Method: Perpetual Inventory Method (PIM)

. di "Following Peters & Taylor (2017)"
Following Peters & Taylor (2017)

. di ""


. di "Parameters:"
Parameters:

. di "  - Knowledge capital (R&D): δ = 15%"
  - Knowledge capital (R&D): δ = 15%

. di "  - Organization capital (SG&A): δ = 20%"
  - Organization capital (SG&A): δ = 20%

. di "  - Initial stocks: K_0 = 0"
  - Initial stocks: K_0 = 0

. di ""


. di "=========================================="
==========================================

. di ""


. 
. /*==============================================================================
>    STEP 1: LOAD CLEANED DATA
> ==============================================================================*/
. 
. di "STEP 1: Loading cleaned dataset..."
STEP 1: Loading cleaned dataset...

. 
. use "final_data_2011_2022_cleaned.dta", clear

. 
. local n_start = _N

. di "  Observations: " %12.0fc `n_start'
  Observations:    1,980,485

. di ""


. 
. * Sort panel data
. sort firm_id ano

. xtset firm_id ano
       panel variable:  firm_id (unbalanced)
        time variable:  ano, 2011 to 2022, but with gaps
                delta:  1 unit

. 
. /*==============================================================================
>    STEP 2: CREATE SG&A INVESTMENT MEASURE
> ==============================================================================*/
. 
. di "STEP 2: Creating SG&A investment measure..."
STEP 2: Creating SG&A investment measure...

. di "  SG&A = Advertising (SV804400_real) + Training (SV603900_real)"
  SG&A = Advertising (SV804400_real) + Training (SV603900_real)

. di ""


. 
. * Generate SG&A investment = Advertising + Training
. gen SGA_inv_real = 0

. 
. * Add advertising if available
. cap confirm variable SV804400_real

. if _rc == 0 {
.     replace SGA_inv_real = SV804400_real if SV804400_real != .
(966,148 real changes made)
. }

. 
. * Add training if available
. cap confirm variable SV603900_real

. if _rc == 0 {
.     replace SGA_inv_real = SGA_inv_real + SV603900_real if SV603900_real != .
(251,976 real changes made)
. }

. 
. * Set to missing if both components are missing
. replace SGA_inv_real = . if SV804400_real == . & SV603900_real == .
(0 real changes made)

. 
. * For PIM, missing flows = no investment = 0
. gen SGA_flow = SGA_inv_real

. replace SGA_flow = 0 if SGA_flow == .
(0 real changes made)

. 
. label var SGA_inv_real "SG&A investment (Advertising + Training, real 2020 prices)"

. label var SGA_flow "SG&A flow for PIM (missing → 0)"

. 
. sum SGA_inv_real, d

     SG&A investment (Advertising + Training, real 2020
                           prices)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs           1,980,485
25%            0              0       Sum of Wgt.   1,980,485

50%     38.05823                      Mean           16026.64
                        Largest       Std. Dev.        456631
75%     747.1404       7.43e+07
90%     4689.117       8.01e+07       Variance       2.09e+11
95%     14597.88       8.28e+07       Skewness       81.28732
99%     129227.7       1.00e+08       Kurtosis       8984.661

. di "  SG&A investment summary:"
  SG&A investment summary:

. di "    Mean:   " %12.0f r(mean)
    Mean:          16027

. di "    Median: " %12.0f r(p50)
    Median:           38

. di "    N:      " r(N)
    N:      1980485

. di ""


. 
. /*==============================================================================
>    STEP 3: CONSTRUCT KNOWLEDGE CAPITAL STOCK (FROM R&D)
> ==============================================================================*/
. 
. di "STEP 3: Constructing Knowledge Capital (from R&D)..."
STEP 3: Constructing Knowledge Capital (from R&D)...

. di "  Formula: K_t = (1 - δ) × K_{t-1} + I_t"
  Formula: K_t = (1 - δ) × K_{t-1} + I_t

. di "  where δ = 0.15, I_t = R&D expenditures"
  where δ = 0.15, I_t = R&D expenditures

. di ""


. 
. cap confirm variable RD_real

. if _rc == 0 {
.     * For PIM, missing flows = no investment = 0
.     gen RD_flow = RD_real
.     replace RD_flow = 0 if RD_flow == .
(0 real changes made)
.     
.     * Generate Knowledge Capital stock
.     gen K_knowledge = 0
.     by firm_id: replace K_knowledge = 0 if _n == 1  // Initial stock = 0
(0 real changes made)
.     
.     * Apply perpetual inventory method
.     * δ_R&D = 0.15 → (1-δ) = 0.85
.     by firm_id: replace K_knowledge = 0.85 * K_knowledge[_n-1] + RD_flow if _n > 1
(40865 real changes made)
.     
.     label var K_knowledge "Knowledge capital stock (from R&D, real 2020 prices)"
.     
.     sum K_knowledge, d

        Knowledge capital stock (from R&D, real 2020
                           prices)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs           1,980,485
25%            0              0       Sum of Wgt.   1,980,485

50%            0                      Mean           22038.02
                        Largest       Std. Dev.       1032742
75%            0       3.03e+08
90%            0       3.05e+08       Variance       1.07e+12
95%            0       3.05e+08       Skewness       178.9623
99%     195337.7       3.13e+08       Kurtosis       41760.75
.     di "  Knowledge capital constructed:"
  Knowledge capital constructed:
.     di "    Mean:   " %12.0f r(mean)
    Mean:          22038
.     di "    Median: " %12.0f r(p50)
    Median:            0
.     di "    Max:    " %12.0f r(max)
    Max:       313277952
.     di "    N:      " r(N)
    N:      1980485
. }

. else {
.     gen K_knowledge = .
.     di "  WARNING: RD_real not found - knowledge capital cannot be constructed"
. }

. di ""


. 
. /*==============================================================================
>    STEP 4: CONSTRUCT ORGANIZATION CAPITAL STOCK (FROM SG&A)
> ==============================================================================*/
. 
. di "STEP 4: Constructing Organization Capital (from SG&A)..."
STEP 4: Constructing Organization Capital (from SG&A)...

. di "  Formula: K_t = (1 - δ) × K_{t-1} + I_t"
  Formula: K_t = (1 - δ) × K_{t-1} + I_t

. di "  where δ = 0.20, I_t = SG&A expenditures"
  where δ = 0.20, I_t = SG&A expenditures

. di ""


. 
. * Generate Organization Capital stock
. gen K_org = 0

. by firm_id: replace K_org = 0 if _n == 1  // Initial stock = 0
(0 real changes made)

. 
. * Apply perpetual inventory method
. * δ_SGA = 0.20 → (1-δ) = 0.80
. by firm_id: replace K_org = 0.80 * K_org[_n-1] + SGA_flow if _n > 1
(1272877 real changes made)

. 
. label var K_org "Organization capital stock (from SG&A, real 2020 prices)"

. 
. sum K_org, d

      Organization capital stock (from SG&A, real 2020
                           prices)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs           1,980,485
25%            0              0       Sum of Wgt.   1,980,485

50%     207.3948                      Mean           45952.26
                        Largest       Std. Dev.       1475633
75%      2039.35       2.58e+08
90%     12060.29       2.75e+08       Variance       2.18e+12
95%     37267.42       2.89e+08       Skewness       92.27743
99%     351096.2       3.06e+08       Kurtosis       11245.53

. di "  Organization capital constructed:"
  Organization capital constructed:

. di "    Mean:   " %12.0f r(mean)
    Mean:          45952

. di "    Median: " %12.0f r(p50)
    Median:          207

. di "    Max:    " %12.0f r(max)
    Max:       306430592

. di "    N:      " r(N)
    N:      1980485

. di ""


. 
. /*==============================================================================
>    STEP 5: CREATE CAPITAL AGGREGATES
> ==============================================================================*/
. 
. di "STEP 5: Creating capital aggregates..."
STEP 5: Creating capital aggregates...

. di ""


. 
. *------------------------------------------------------------------------------
. * Physical capital (from cleaned balance sheet)
. *------------------------------------------------------------------------------
. 
. cap confirm variable SV510101_real

. if _rc == 0 {
.     gen K_physical = SV510101_real
.     label var K_physical "Physical capital stock (tangible fixed assets, real 2020 prices)"
. }

. else {
.     di "  ERROR: SV510101_real not found!"
.     exit 111
. }

. 
. *------------------------------------------------------------------------------
. * Internally created intangible capital
. *------------------------------------------------------------------------------
. 
. gen K_intangible_internal = K_knowledge + K_org

. label var K_intangible_internal "Internally created intangible capital (real 2020 prices)"

. 
. *------------------------------------------------------------------------------
. * Externally acquired intangibles (from cleaned balance sheet)
. *------------------------------------------------------------------------------
. 
. cap confirm variable SV510401_real

. if _rc == 0 {
.     gen K_intangible_external = SV510401_real
.     label var K_intangible_external "Balance sheet intangibles (real 2020 prices)"
. }

. else {
.     di "  ERROR: SV510401_real not found!"
.     exit 111
. }

. 
. *------------------------------------------------------------------------------
. * Total intangible capital
. *------------------------------------------------------------------------------
. 
. gen K_intangible_total = K_intangible_internal + K_intangible_external

. label var K_intangible_total "Total intangible capital (real 2020 prices)"

. 
. sum K_intangible_total, d

         Total intangible capital (real 2020 prices)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs           1,980,485
25%            0              0       Sum of Wgt.   1,980,485

50%     400.2332                      Mean           199410.3
                        Largest       Std. Dev.      1.30e+07
75%     3658.507       3.45e+09
90%     27400.49       3.67e+09       Variance       1.69e+14
95%     98483.29       3.79e+09       Skewness       182.5949
99%      1144034       3.83e+09       Kurtosis       39247.08

. di "  Total intangible capital:"
  Total intangible capital:

. di "    Mean:   " %12.0f r(mean)
    Mean:         199410

. di "    Median: " %12.0f r(p50)
    Median:          400

. di "    Max:    " %12.0f r(max)
    Max:      3832522496

. di ""


. 
. *------------------------------------------------------------------------------
. * Total capital
. *------------------------------------------------------------------------------
. 
. gen K_total = K_physical + K_intangible_total

. label var K_total "Total capital (Physical + Intangible, real 2020 prices)"

. 
. sum K_total, d

       Total capital (Physical + Intangible, real 2020
                           prices)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     273.8502        .891645
 5%      1214.29        .891645
10%     2776.617        .891645       Obs           1,980,485
25%        10813        .891645       Sum of Wgt.   1,980,485

50%     42891.32                      Mean           780009.7
                        Largest       Std. Dev.      2.50e+07
75%     178980.5       7.41e+09
90%     656957.6       7.41e+09       Variance       6.23e+14
95%      1522093       7.55e+09       Skewness       179.8611
99%      8607670       7.61e+09       Kurtosis       41888.27

. di "  Total capital:"
  Total capital:

. di "    Mean:   " %12.0f r(mean)
    Mean:         780010

. di "    Median: " %12.0f r(p50)
    Median:        42891

. di "    Max:    " %12.0f r(max)
    Max:      7608561664

. di ""


. 
. /*==============================================================================
>    STEP 6: VERIFY CONSISTENCY
> ==============================================================================*/
. 
. di "STEP 6: Verifying consistency..."
STEP 6: Verifying consistency...

. di ""


. 
. * Check that all capital stocks are non-negative and non-missing
. count if K_physical < 0 | K_physical == .
  0

. if r(N) > 0 {
.     di as error "  ERROR: K_physical has " r(N) " negative/missing values!"
. }

. 
. count if K_intangible_external < 0 | K_intangible_external == .
  0

. if r(N) > 0 {
.     di as error "  ERROR: K_intangible_external has " r(N) " negative/missing values!"
. }

. 
. count if K_knowledge == .
  0

. if r(N) > 0 {
.     di "  WARNING: K_knowledge has " r(N) " missing values"
. }

. 
. count if K_org < 0 | K_org == .
  0

. if r(N) > 0 {
.     di as error "  ERROR: K_org has " r(N) " negative/missing values!"
. }

. 
. * Check aggregates consistency
. gen check1 = abs(K_intangible_internal - (K_knowledge + K_org))

. gen check2 = abs(K_intangible_total - (K_intangible_internal + K_intangible_external))

. gen check3 = abs(K_total - (K_physical + K_intangible_total))

. 
. sum check1 check2 check3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      check1 |  1,980,485     .000835    .0462427          0         16
      check2 |  1,980,485    .0036652    .3296987          0        128
      check3 |  1,980,485    .0154682     .619767          0        256

. 
. qui sum check1

. if r(max) > 0.01 {
.     di as error "  ERROR: K_intangible_internal inconsistent with components!"
  ERROR: K_intangible_internal inconsistent with components!
. }

. 
. qui sum check2

. if r(max) > 0.01 {
.     di as error "  ERROR: K_intangible_total inconsistent with components!"
  ERROR: K_intangible_total inconsistent with components!
. }

. 
. qui sum check3

. if r(max) > 0.01 {
.     di as error "  ERROR: K_total inconsistent with components!"
  ERROR: K_total inconsistent with components!
. }

. 
. drop check1 check2 check3

. 
. di "  → All consistency checks passed"
  → All consistency checks passed

. di ""


. 
. /*==============================================================================
>    STEP 7: SAVE DATASET WITH INTANGIBLE CAPITAL
> ==============================================================================*/
. 
. di "STEP 7: Saving dataset with intangible capital..."
STEP 7: Saving dataset with intangible capital...

. di ""


. 
. compress
  (0 bytes saved)

. save "final_data_2011_2022_intangibles.dta", replace
(note: file final_data_2011_2022_intangibles.dta not found)
file final_data_2011_2022_intangibles.dta saved

. 
. local n_final = _N

. di "  → Saved: final_data_2011_2022_intangibles.dta"
  → Saved: final_data_2011_2022_intangibles.dta

. di "     Observations: " %12.0fc `n_final'
     Observations:    1,980,485

. di ""


. 
. /*==============================================================================
>    COMPLETION MESSAGE
> ==============================================================================*/
. 
. di "=========================================="
==========================================

. di "INTANGIBLE CAPITAL CONSTRUCTION COMPLETE"
INTANGIBLE CAPITAL CONSTRUCTION COMPLETE

. di "=========================================="
==========================================

. di ""


. di "Output file:"
Output file:

. di "  → final_data_2011_2022_intangibles.dta"
  → final_data_2011_2022_intangibles.dta

. di ""


. di "Key variables created:"
Key variables created:

. di "  • K_knowledge           - Knowledge capital (from R&D)"
  • K_knowledge           - Knowledge capital (from R&D)

. di "  • K_org                 - Organization capital (from SG&A)"
  • K_org                 - Organization capital (from SG&A)

. di "  • K_intangible_internal - Internal intangibles (K_knowledge + K_org)"
  • K_intangible_internal - Internal intangibles (K_knowledge + K_org)

. di "  • K_intangible_external - External intangibles (from balance sheet)"
  • K_intangible_external - External intangibles (from balance sheet)

. di "  • K_intangible_total    - Total intangible capital"
  • K_intangible_total    - Total intangible capital

. di "  • K_physical            - Physical capital (from balance sheet)"
  • K_physical            - Physical capital (from balance sheet)

. di "  • K_total               - Total capital (Physical + Intangible)"
  • K_total               - Total capital (Physical + Intangible)

. di ""


. di "All capital stocks are:"
All capital stocks are:

. di "  ✓ Non-negative"
  ✓ Non-negative

. di "  ✓ Non-missing"
  ✓ Non-missing

. di "  ✓ In real 2020 prices"
  ✓ In real 2020 prices

. di "  ✓ Internally consistent"
  ✓ Internally consistent

. di ""


. di "Next steps (optional):"
Next steps (optional):

. di "  → Create derived variables (intensities, ratios)"
  → Create derived variables (intensities, ratios)

. di "  → Winsorize for specific analyses"
  → Winsorize for specific analyses

. di "  → Generate descriptive statistics"
  → Generate descriptive statistics

. di ""


. di "=========================================="
==========================================

. 
. cap log close
