------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE\output\data_cleaning_final.log
  log type:  text
 opened on:  15 Dec 2025, 16:23:25

. 
. di "=========================================="
==========================================

. di "DATA CLEANING & DEFLATION"
DATA CLEANING & DEFLATION

. di "=========================================="
==========================================

. di "Date: `c(current_date)'"
Date: 15 Dec 2025

. di ""


. 
. /*==============================================================================
>    STEP 1: LOAD DATA AND MERGE DEFLATORS
> ==============================================================================*/
. 
. di "STEP 1: Loading merged dataset and deflators..."
STEP 1: Loading merged dataset and deflators...

. 
. use "final_data_2011_2022.dta", clear

. 
. * Keep only SCIE-matched observations
. keep if scie_match == 1
(201,355 observations deleted)

. 
. * Keep only private, non-incorporated businesses
. keep if public == 0
(21,571 observations deleted)

. keep if EFJR0 == "soc" 
(552,944 observations deleted)

. 
. local n_start = _N

. di "  Starting observations: " %12.0fc `n_start'
  Starting observations:    2,329,807

. 
. * Merge deflators (created by prepare_deflators.do)
. merge m:1 ano using "$rootdir/input/deflators.dta", keep(match master)
(note: variable ano was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         2,329,807  (_merge==3)
    -----------------------------------------

. 
. * Verify all observations matched
. count if _merge != 3
  0

. if r(N) > 0 {
.     di as error "ERROR: Some observations did not match with deflators!"
.     di as error "Make sure prepare_deflators.do has been run."
.     exit 111
. }

. drop _merge

. 
. di "  → Deflators merged successfully"
  → Deflators merged successfully

. di ""


. 
. /*==============================================================================
>    STEP 2: DEFLATE ALL VARIABLES TO REAL 2020 PRICES
> ==============================================================================*/
. 
. di "STEP 2: Deflating variables to real 2020 prices..."
STEP 2: Deflating variables to real 2020 prices...

. di "  Base year: 2020 (deflators = 100)"
  Base year: 2020 (deflators = 100)

. di ""


. 
. *------------------------------------------------------------------------------
. * A. Revenue and sales (GDP deflator)
. *------------------------------------------------------------------------------
. 
. foreach var in SV500101 SD000002 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gdp_deflator) * 100
  5.     }
  6. }

. 
. *------------------------------------------------------------------------------
. * B. Cost variables (GDP deflator)
. *------------------------------------------------------------------------------
. 
. foreach var in SV500601 SV500801 SD000102 SV602500 SV602700 SV603900 ///
>                SV804000 SV804100 SV804200 SV804400 SV804600 SV804700 ///
>                SV804800 SV806700 SV807100 SV569305 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gdp_deflator) * 100
  5.     }
  6. }

. 
. *------------------------------------------------------------------------------
. * C. Result variables (GDP deflator)
. *------------------------------------------------------------------------------
. 
. foreach var in SV501701 SV501801 SV502001 SV502201 SD000011 SD000012 ///
>                SD000014 SD000016 SD000018 SD000019 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gdp_deflator) * 100
  5.     }
  6. }

. 
. *------------------------------------------------------------------------------
. * D. Investment flows (GFCF deflator)
. *------------------------------------------------------------------------------
. 
. foreach var in SD000031 SD000032 SD000036 SD000037 SD000038 SD000113 ///
>                SD000046 SD000047 SD000118 SD000119 SD000120 SD000121 ///
>                SD000122 SD000123 SD000124 SD000125 SD000126 SD000127 ///
>                SD000128 SD557602 SD557603 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gfcf_deflator) * 100
  5.     }
  6. }

. 
. *------------------------------------------------------------------------------
. * E. Disinvestment flows (GFCF deflator)
. *------------------------------------------------------------------------------
. 
. foreach var in SV558201 SD558202 SD558203 SD558204 SV558205 SD563301 ///
>                SD563302 SD563303 SD563304 SD563305 SD563306 SV563307 ///
>                SD000044 SD000115 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gfcf_deflator) * 100
  5.     }
  6. }

. 
. *------------------------------------------------------------------------------
. * F. R&D expenditures (GDP deflator)
. *------------------------------------------------------------------------------
. 
. cap confirm variable IM_RND_EXPN

. if _rc == 0 {
.     gen RD_real = (IM_RND_EXPN / gdp_deflator) * 100
. }

. 
. *------------------------------------------------------------------------------
. * G. Balance sheet variables (Capital deflator)
. *------------------------------------------------------------------------------
. 
. foreach var in SV510101 SV510201 SV510301 SV510401 SV511201 SV512501 ///
>                SV512601 SV512701 SD000005 SV514101 SV514701 SV515901 ///
>                SV516001 SV516101 {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / capital_deflator) * 100
  5.     }
  6. }

. 
. *------------------------------------------------------------------------------
. * H. Wages from QP (GDP deflator)
. *------------------------------------------------------------------------------
. 
. foreach var in avg_wage_all avg_wage_skilled avg_wage_unskilled {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         gen `var'_real = (`var' / gdp_deflator) * 100
  5.     }
  6. }
(1,573,068 missing values generated)
(147,446 missing values generated)

. 
. di "  → All variables deflated"
  → All variables deflated

. di ""


. 
. /*==============================================================================
>    STEP 3: REMOVE STRUCTURAL PROBLEMS
> ==============================================================================*/
. 
. di "STEP 3: Removing structural problems..."
STEP 3: Removing structural problems...

. 
. * Remove missing identifiers
. drop if firm_id == . | ano == .
(0 observations deleted)

. 
. * Remove duplicates
. duplicates drop firm_id ano, force

Duplicates in terms of firm_id ano

(0 observations are duplicates)

. 
. local n_after_step3 = _N

. local n_dropped_step3 = `n_start' - `n_after_step3'

. di "  Dropped: " %8.0fc `n_dropped_step3' " (missing IDs, duplicates)"
  Dropped:        0 (missing IDs, duplicates)

. di "  Remaining: " %12.0fc `n_after_step3'
  Remaining:    2,329,807

. di ""


. 
. /*==============================================================================
>    STEP 4: DROP OBSERVATIONS WITH MISSING OR NEGATIVE VALUES
> ==============================================================================*/
. 
. di "STEP 4: Dropping observations with missing or negative values..."
STEP 4: Dropping observations with missing or negative values...

. di ""


. 
. * Count observations before this step
. local n_before_step4 = _N

. 
. * List of variables to check (must exist and be non-negative)
. * SV510101_real: Tangible fixed assets (physical capital)
. * SV510401_real: Intangible assets (excluding goodwill)
. * SV500101_real: Revenue
. * SD000011_real: Production value
. * SV500801_real: Wagebill
. * SV516001_real: Total debt
. * SV514701_real: Long-term debt
. * SV515901_real: Short-term debt
. * SV502201_real: Interest expenses
. * SD000032_real: Tangible investment
. * RD_real: R&D expenditures
. * SV804400_real: Advertising expenses
. * SV603900_real: Training expenses
. 
. local vars_check "SV510101_real SV510401_real SV500101_real SD000011_real SV500801_real SV516001_real SV514701_real SV515901
> _real SV502201_real SD000032_real"

. 
. * Add intangible construction inputs if they exist
. cap confirm variable RD_real

. if _rc == 0 {
.     local vars_check "`vars_check' RD_real"
. }

. 
. cap confirm variable SV804400_real

. if _rc == 0 {
.     local vars_check "`vars_check' SV804400_real"
. }

. 
. cap confirm variable SV603900_real

. if _rc == 0 {
.     local vars_check "`vars_check' SV603900_real"
. }

. 
. * Drop observations with missing or negative values
. local n_dropped = 0

. foreach var of local vars_check {
  2.     cap confirm variable `var'
  3.     if _rc == 0 {
  4.         count if (`var' == . | `var' < 0)
  5.         local n_bad = r(N)
  6.         if `n_bad' > 0 {
  7.             qui drop if (`var' == . | `var' < 0)
  8.             local n_dropped = `n_dropped' + `n_bad'
  9.         }
 10.     }
 11. }
  0
  300
  0
  11,176
  3
  172
  28
  859
  0
  0
  0
  0
  0

. 
. local n_after_step4 = _N

. local n_dropped_step4 = `n_before_step4' - `n_after_step4'

. 
. di "  Variables checked (must exist and be non-negative):"
  Variables checked (must exist and be non-negative):

. di "    SV510101_real, SV510401_real, SV500101_real, SD000011_real,"
    SV510101_real, SV510401_real, SV500101_real, SD000011_real,

. di "    SV500801_real, SV516001_real, SV514701_real, SV515901_real,"
    SV500801_real, SV516001_real, SV514701_real, SV515901_real,

. di "    SV502201_real, SD000032_real, RD_real, SV804400_real, SV603900_real"
    SV502201_real, SD000032_real, RD_real, SV804400_real, SV603900_real

. di ""


. di "  Total dropped: " %8.0fc `n_dropped_step4'
  Total dropped:   12,538

. di "  Remaining: " %12.0fc `n_after_step4'
  Remaining:    2,317,269

. di ""


. di "  Note: SV514101_real (equity) NOT checked - can be negative"
  Note: SV514101_real (equity) NOT checked - can be negative

. di ""


. 
. /*==============================================================================
>    STEP 5: DROP OBSERVATIONS WITH MISSING ECONOMIC ACTIVITY
> ==============================================================================*/
. 
. di "STEP 5: Dropping observations with missing economic activity..."
STEP 5: Dropping observations with missing economic activity...

. di ""


. 
. gen flag_no_activity = 0

. 
. * No workers
. replace flag_no_activity = 1 if n_workers == 0 | n_workers == .
(0 real changes made)

. 
. * No tangible fixed assets
. replace flag_no_activity = 1 if SV510101_real == 0 | SV510101_real == .
(241,986 real changes made)

. 
. * No revenue
. replace flag_no_activity = 1 if SV500101_real == 0 | SV500101_real == .
(21,136 real changes made)

. 
. * No production
. replace flag_no_activity = 1 if SD000011_real == 0 | SD000011_real == .
(76 real changes made)

. 
. * No wagebill
. replace flag_no_activity = 1 if SV500801_real == 0 | SV500801_real == .
(1,299 real changes made)

. 
. count if flag_no_activity == 1
  264,497

. local n_no_activity = r(N)

. di "  No economic activity: " %8.0fc `n_no_activity'
  No economic activity:  264,497

. di "    (Missing/zero: workers, tangible capital, revenue, production, or wagebill)"
    (Missing/zero: workers, tangible capital, revenue, production, or wagebill)

. 
. drop if flag_no_activity == 1
(264,497 observations deleted)

. drop flag_no_activity

. 
. local n_after_step5 = _N

. di ""


. di "  Total dropped: " %8.0fc `n_no_activity'
  Total dropped:  264,497

. di "  Remaining: " %12.0fc `n_after_step5'
  Remaining:    2,052,772

. di ""


. 
. /*==============================================================================
>    STEP 6: REQUIRE 2+ CONSECUTIVE OBSERVATIONS
> ==============================================================================*/
. 
. di "STEP 6: Requiring 2+ consecutive observations..."
STEP 6: Requiring 2+ consecutive observations...

. di ""


. 
. * Declare panel structure
. xtset firm_id ano
       panel variable:  firm_id (unbalanced)
        time variable:  ano, 2011 to 2022, but with gaps
                delta:  1 unit

. 
. * Check if next observation exists and is consecutive
. gen temp_consecutive = (F.firm_id == firm_id & !missing(F.ano))

. 
. * Flag ALL observations for firms that have at least one consecutive pair
. bysort firm_id: egen has_2consecutive = max(temp_consecutive)

. 
. drop temp_consecutive

. 
. count if has_2consecutive == 0
  72,287

. local n_no_consecutive = r(N)

. di "  Firms without consecutive obs: " %8.0fc `n_no_consecutive'
  Firms without consecutive obs:   72,287

. 
. keep if has_2consecutive == 1
(72,287 observations deleted)

. drop has_2consecutive

. 
. local n_after_step6 = _N

. di "  Remaining: " %12.0fc `n_after_step6'
  Remaining:    1,980,485

. di ""


. 
. /*==============================================================================
>    STEP 7: SAVE CLEANED DATASET
> ==============================================================================*/
. 
. di "STEP 7: Saving cleaned dataset..."
STEP 7: Saving cleaned dataset...

. di ""


. 
. compress
  variable ano was float now int
  (3,960,970 bytes saved)

. save "final_data_2011_2022_cleaned.dta", replace
file final_data_2011_2022_cleaned.dta saved

. 
. di "  → Saved: final_data_2011_2022_cleaned.dta"
  → Saved: final_data_2011_2022_cleaned.dta

. di "     Observations: " %12.0fc `n_after_step6'
     Observations:    1,980,485

. di ""


. 
. /*==============================================================================
>    CLEANING SUMMARY
> ==============================================================================*/
. 
. di "=========================================="
==========================================

. di "CLEANING SUMMARY"
CLEANING SUMMARY

. di "=========================================="
==========================================

. di ""


. di "Initial observations:                  " %12.0fc `n_start'
Initial observations:                     2,329,807

. di ""


. di "Step 3 - Structural problems:          " %12.0fc `n_dropped_step3'
Step 3 - Structural problems:                     0

. di "Step 4 - Missing/negative values:      " %12.0fc `n_dropped_step4'
Step 4 - Missing/negative values:            12,538

. di "Step 5 - No economic activity:         " %12.0fc `n_no_activity'
Step 5 - No economic activity:              264,497

. di "Step 6 - No consecutive obs:           " %12.0fc `n_no_consecutive'
Step 6 - No consecutive obs:                 72,287

. di "                                        " "─────────────"
                                        ─────────────

. local total_dropped = `n_start' - `n_after_step6'

. di "Total excluded:                        " %12.0fc `total_dropped'
Total excluded:                             349,322

. di ""


. di "Final clean sample:                    " %12.0fc `n_after_step6'
Final clean sample:                       1,980,485

. di ""


. di "Retention rate:                        " %6.2f (100 * `n_after_step6' / `n_start') "%"
Retention rate:                         85.01%

. di ""


. di "=========================================="
==========================================

. di "CLEANING CHECKS PERFORMED"
CLEANING CHECKS PERFORMED

. di "=========================================="
==========================================

. di ""


. di "Step 4: Missing or negative values (dropped):"
Step 4: Missing or negative values (dropped):

. di "   Variables: SV510101_real, SV510401_real, SV500101_real,"
   Variables: SV510101_real, SV510401_real, SV500101_real,

. di "              SD000011_real, SV500801_real, SV516001_real,"
              SD000011_real, SV500801_real, SV516001_real,

. di "              SV514701_real, SV515901_real, SV502201_real,"
              SV514701_real, SV515901_real, SV502201_real,

. di "              SD000032_real, RD_real, SV804400_real, SV603900_real"
              SD000032_real, RD_real, SV804400_real, SV603900_real

. di ""


. di "Step 5: Missing economic activity (dropped if zero/missing):"
Step 5: Missing economic activity (dropped if zero/missing):

. di "   Variables: n_workers, SV510101_real, SV500101_real,"
   Variables: n_workers, SV510101_real, SV500101_real,

. di "              SD000011_real, SV500801_real"
              SD000011_real, SV500801_real

. di ""


. di "Step 6: Panel structure:"
Step 6: Panel structure:

. di "   Required 2+ consecutive observations per firm"
   Required 2+ consecutive observations per firm

. di ""


. di "Note: SV514101_real (equity) NOT checked - can be negative"
Note: SV514101_real (equity) NOT checked - can be negative

. di "Note: SV510101_real (tangible fixed assets) checked in BOTH steps:"
Note: SV510101_real (tangible fixed assets) checked in BOTH steps:

. di "      Step 4 drops if negative or missing (data error)"
      Step 4 drops if negative or missing (data error)

. di "      Step 5 drops if zero (no activity)"
      Step 5 drops if zero (no activity)

. di ""


. di "=========================================="
==========================================

. di "NEXT STEP"
NEXT STEP

. di "=========================================="
==========================================

. di ""


. di "Run: construct_intangibles.do"
Run: construct_intangibles.do

. di ""


. di "This will build capital stocks from the"
This will build capital stocks from the

. di "clean source variables created here."
clean source variables created here.

. di ""


. di "Note: Missing R&D, advertising, training"
Note: Missing R&D, advertising, training

. di "      will be set to 0 in the PIM (standard"
      will be set to 0 in the PIM (standard

. di "      assumption: missing flow = no investment)"
      assumption: missing flow = no investment)

. di ""


. di "=========================================="
==========================================

. 
. cap log close
