------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE\output\empirical_analysis.log
  log type:  text
 opened on:   9 Jan 2026, 12:36:10

. 
. di "=========================================="
==========================================

. di "EMPIRICAL ANALYSIS"
EMPIRICAL ANALYSIS

. di "Date: `c(current_date)'"
Date:  9 Jan 2026

. di "=========================================="
==========================================

. di ""


. 
. /*==============================================================================
>    SETUP
> ==============================================================================*/
. 
. use "final_data_2011_2022_analysis.dta", clear

. 
. * Declare panel
. xtset firm_id ano
       panel variable:  firm_id (unbalanced)
        time variable:  ano, 2011 to 2022, but with gaps
                delta:  1 unit

. 
. * Create results directory
. cap mkdir "$rootdir/results"

. 
. di "Sample size: " _N
Sample size: 1759093

. di ""


. 
. /*==============================================================================
>    FACT 1: COMPLEMENTARITY BETWEEN INTANGIBLES AND SKILLED LABOR
> ==============================================================================*/
. 
. di "=========================================="
==========================================

. di "FACT 1: COMPLEMENTARITY"
FACT 1: COMPLEMENTARITY

. di "=========================================="
==========================================

. di ""


. 
. *------------------------------------------------------------------------------
. * Visual evidence: Raw correlation
. *------------------------------------------------------------------------------
. 
. binscatter intang_intensity_bs_rd share_skilled if intang_intensity > 0 & share_skilled > 0, nquantiles(20) ///
>     xtitle("Share of skilled workers") ///
>     ytitle("Intangible intensity") ///
>     title("Intangibles and Skills: Raw Correlation") ///
>     note("Excludes firms with zero intangible capital or no skilled workers. 20 quantiles.")
warning: nquantiles(20) was specified, but only 17 were generated. see help file under nquantiles() for explanation.

. graph export "$rootdir/results/fact1_raw_correlation.png", replace width(2000)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact1_raw_correlation.png written i
> n PNG format)

. 
. di "  ✓ Figure saved: fact1_raw_correlation.png"
  ✓ Figure saved: fact1_raw_correlation.png

. di ""


. 
. *------------------------------------------------------------------------------
. * Main regression table: Complementarity across three outcomes
. *------------------------------------------------------------------------------
. 
. di "  → Running complementarity regressions..."
  → Running complementarity regressions...

. di ""


. 
. eststo clear

. 
. * Column 1: Log Revenue
. reghdfe ln_revenue c.intang_intensity_bs_rd##c.share_skilled ln_K_total_bs_rd ln_emp ln_age, absorb(ano cae3 firm_id) vce(ro
> bust)
(MWFE estimator converged in 56 iterations)

HDFE Linear regression                            Number of obs   =  1,759,084
Absorbing 3 HDFE groups                           F(   6,1502834) =   39240.25
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9518
                                                  Adj R-squared   =     0.9436
                                                  Within R-sq.    =     0.2767
                                                  Root MSE        =     0.3554

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                              ln_revenue |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1018422   .0064696   -15.74   0.000    -.1145223   -.0891621
                           share_skilled |  -.0127821   .0036421    -3.51   0.000    -.0199205   -.0056437
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0261977   .0136834     1.91   0.056    -.0006213    .0530166
                                         |
                        ln_K_total_bs_rd |    .087171   .0005329   163.59   0.000     .0861266    .0882154
                                  ln_emp |   .4485111   .0012561   357.06   0.000     .4460492    .4509731
                                  ln_age |   .3135366   .0017529   178.86   0.000     .3101009    .3169723
                                   _cons |   10.29652   .0070657  1457.25   0.000     10.28267    10.31037
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         ano |        12           0          12     |
        cae3 |        83           1          82     |
     firm_id |    256152           2      256150    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. eststo revenue

. estadd local year_fe "Yes"

added macro:
            e(year_fe) : "Yes"

. estadd local industry_fe "Yes"

added macro:
        e(industry_fe) : "Yes"

. estadd local firm_fe "Yes"

added macro:
            e(firm_fe) : "Yes"

. estadd local controls "Yes"

added macro:
           e(controls) : "Yes"

. 
. * Column 2: Log Production
. reghdfe ln_production c.intang_intensity_bs_rd##c.share_skilled ln_K_total_bs_rd ln_emp ln_age, absorb(ano cae3 firm_id) vce
> (robust)
(MWFE estimator converged in 57 iterations)

HDFE Linear regression                            Number of obs   =  1,759,084
Absorbing 3 HDFE groups                           F(   6,1502834) =   46124.00
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9513
                                                  Adj R-squared   =     0.9430
                                                  Within R-sq.    =     0.2993
                                                  Root MSE        =     0.3409

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                           ln_production |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1111231   .0061259   -18.14   0.000    -.1231296   -.0991165
                           share_skilled |  -.0083815   .0033361    -2.51   0.012    -.0149202   -.0018427
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0416667   .0125308     3.33   0.001     .0171067    .0662266
                                         |
                        ln_K_total_bs_rd |   .0911289   .0005005   182.09   0.000      .090148    .0921098
                                  ln_emp |   .4547085   .0011632   390.92   0.000     .4524287    .4569883
                                  ln_age |    .307833   .0016997   181.11   0.000     .3045017    .3111643
                                   _cons |   9.911814   .0067262  1473.60   0.000     9.898631    9.924997
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         ano |        12           0          12     |
        cae3 |        83           1          82     |
     firm_id |    256152           2      256150    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. eststo production

. estadd local year_fe "Yes"

added macro:
            e(year_fe) : "Yes"

. estadd local industry_fe "Yes"

added macro:
        e(industry_fe) : "Yes"

. estadd local firm_fe "Yes"

added macro:
            e(firm_fe) : "Yes"

. estadd local controls "Yes"

added macro:
           e(controls) : "Yes"

. 
. * Column 3: Log GVA
. reghdfe ln_GVA c.intang_intensity_bs_rd##c.share_skilled ln_K_total_bs_rd ln_emp ln_age, absorb(ano cae3 firm_id) vce(robust
> )
(dropped 1 singleton observations)
(MWFE estimator converged in 56 iterations)

HDFE Linear regression                            Number of obs   =  1,759,076
Absorbing 3 HDFE groups                           F(   6,1502827) =   36353.81
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.8950
                                                  Adj R-squared   =     0.8771
                                                  Within R-sq.    =     0.2033
                                                  Root MSE        =     0.5128

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                                  ln_GVA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1253611   .0089436   -14.02   0.000    -.1428903    -.107832
                           share_skilled |  -.0154463   .0046469    -3.32   0.001    -.0245541   -.0063386
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0398381   .0174711     2.28   0.023     .0055953    .0740809
                                         |
                        ln_K_total_bs_rd |   .0901497   .0006737   133.81   0.000     .0888292    .0914702
                                  ln_emp |   .5461208   .0015443   353.64   0.000     .5430941    .5491476
                                  ln_age |   .3551492   .0024089   147.43   0.000     .3504279    .3598705
                                   _cons |   8.857374   .0089527   989.35   0.000     8.839827    8.874921
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         ano |        12           0          12     |
        cae3 |        83           1          82     |
     firm_id |    256151           2      256149    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. eststo gva

. estadd local year_fe "Yes"

added macro:
            e(year_fe) : "Yes"

. estadd local industry_fe "Yes"

added macro:
        e(industry_fe) : "Yes"

. estadd local firm_fe "Yes"

added macro:
            e(firm_fe) : "Yes"

. estadd local controls "Yes"

added macro:
           e(controls) : "Yes"

. 
. di ""


. di "  ✓ All regressions completed"
  ✓ All regressions completed

. di ""


. 
. *------------------------------------------------------------------------------
. * Export table to LaTeX
. *------------------------------------------------------------------------------
. 
. esttab revenue production gva using "$rootdir/results/fact1_complementarity.tex", ///
>     replace booktabs ///
>     b(3) se(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     mtitles("Log Revenue" "Log Production" "Log GVA") ///
>     title("Complementarity Between Intangibles and Skilled Labor\label{tab:complementarity}") ///
>     keep(c.intang_intensity_bs_rd#c.share_skilled intang_intensity_bs_rd share_skilled) ///
>     order(c.intang_intensity_bs_rd#c.share_skilled intang_intensity_bs_rd share_skilled) ///
>     coeflabels(c.intang_intensity_bs_rd#c.share_skilled "Intangible Intensity $\times$ Share Skilled" ///
>                intang_intensity_bs_rd "Intangible Intensity" ///
>                share_skilled "Share Skilled Workers") ///
>     scalars("year_fe Year FE" "industry_fe Industry FE" "firm_fe Firm FE" "controls Controls") ///
>     sfmt(0 0 0 0) ///
>     nonotes ///
>     addnotes("Controls include log total capital, log employment, and log firm age." ///
>              "Industry FE based on 3-digit CAE codes. Robust standard errors in parentheses." ///
>              "* \$p < 0.10\$, ** \$p < 0.05\$, *** \$p < 0.01\$")
(output written to C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact1_complementarity.
> tex)

. 
. di "  ✓ Table saved: fact1_complementarity.tex"
  ✓ Table saved: fact1_complementarity.tex

. di ""


. 
. *------------------------------------------------------------------------------
. * Display results in console
. *------------------------------------------------------------------------------
. 
. esttab revenue production gva, ///
>     b(3) se(3) star(* 0.10 ** 0.05 *** 0.01) ///
>     mtitles("Revenue" "Production" "GVA") ///
>     keep(c.intang_intensity_bs_rd#c.share_skilled intang_intensity_bs_rd share_skilled) ///
>     scalars("year_fe Year FE" "industry_fe Ind FE" "firm_fe Firm FE" "controls Controls") ///
>     title("FACT 1: Complementarity Between Intangibles and Skills")

FACT 1: Complementarity Between Intangibles and Skills
------------------------------------------------------------
                      (1)             (2)             (3)   
                  Revenue      Production             GVA   
------------------------------------------------------------
intang_int~d       -0.102***       -0.111***       -0.125***
                  (0.006)         (0.006)         (0.009)   

share_skil~d       -0.013***       -0.008**        -0.015***
                  (0.004)         (0.003)         (0.005)   

c.intang_i~s        0.026*          0.042***        0.040** 
                  (0.014)         (0.013)         (0.017)   
------------------------------------------------------------
N                 1759084         1759084         1759076   
Year FE               Yes             Yes             Yes   
Ind FE                Yes             Yes             Yes   
Firm FE               Yes             Yes             Yes   
Controls              Yes             Yes             Yes   
------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. 
. di ""


. di "=========================================="
==========================================

. di "FACT 1 ANALYSIS COMPLETE"
FACT 1 ANALYSIS COMPLETE

. di "=========================================="
==========================================

. di ""


. di "Output: $rootdir/results/fact1_complementarity.tex"
Output: C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact1_complementarity.tex

. di ""


. 
. 
. /*==============================================================================
>    FACT 2: PECKING ORDER DISTORTION
>    
>    Theory: Financial constraints create pecking order where constrained firms
>            under-invest in intangible capital (non-pledgeable) relative to 
>            physical capital (pledgeable), and underallocate workers to R&D
>    
> ==============================================================================*/
. 
. di "=========================================="
==========================================

. di "FACT 2: PECKING ORDER DISTORTION"
FACT 2: PECKING ORDER DISTORTION

. di "=========================================="
==========================================

. di ""


. 
. *------------------------------------------------------------------------------
. * Winsorize constraint and investment variables
. *------------------------------------------------------------------------------
. 
. di "  → Winsorizing variables (1-99 by year and sector)..."
  → Winsorizing variables (1-99 by year and sector)...

. di ""


. 
. winsor2 leverage_assets, suffix(_win) cuts(1 99) by(ano cae3)

. winsor2 inv_rate_physical inv_rate_intang_bs_rd, suffix(_win) cuts(1 99) by(ano cae3)

. 
. di "     ✓ Variables winsorized"
     ✓ Variables winsorized

. di ""


. 
. *------------------------------------------------------------------------------
. * Visual evidence: Residualized binscatters with leverage
. *------------------------------------------------------------------------------
. 
. di "  → Creating residualized binscatters..."
  → Creating residualized binscatters...

. di ""


. 
. * Physical investment vs. leverage
. qui reghdfe inv_rate_physical_win ln_K_total_bs_rd ln_emp ln_age, ///
>     absorb(ano cae3 firm_id) resid

. predict resid_inv_phys, resid
(383,466 missing values generated)

. qui reghdfe leverage_assets_win, absorb(ano cae3 firm_id) resid

. predict resid_leverage, resid

. 
. binscatter resid_inv_phys resid_leverage, ///
>     nquantiles(20) ///
>     xtitle("Leverage, residualized") ///
>     ytitle("Physical investment rate, residualized") ///
>     title("Physical Investment and Financial Constraints") ///
>     note("Residuals from regression on firm, year and sector FE, log capital, log employment, log age.")

. graph export "$rootdir/results/fact2_physical_inv_leverage.png", replace width(2000)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_physical_inv_leverage.png wri
> tten in PNG format)

. 
. drop resid_inv_phys resid_leverage

. 
. * Intangible investment vs. leverage
. qui reghdfe inv_rate_intang_bs_rd_win ln_K_total_bs_rd ln_emp ln_age, ///
>     absorb(firm_id ano cae3) resid

. predict resid_inv_intang, resid
(383,497 missing values generated)

. qui reghdfe leverage_assets_win, absorb(firm_id ano cae3) resid

. predict resid_leverage, resid

. 
. binscatter resid_inv_intang resid_leverage, ///
>     nquantiles(20) ///
>     xtitle("Leverage, residualized") ///
>     ytitle("Intangible investment rate, residualized") ///
>     title("Intangible Investment and Financial Constraints") ///
>     note("Residuals from regression on firm, year and sector FE, log capital, log employment, log age.")

. graph export "$rootdir/results/fact2_intangible_inv_leverage.png", replace width(2000)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_intangible_inv_leverage.png w
> ritten in PNG format)

. 
. drop resid_inv_intang resid_leverage

. 
. * Intangible intensity vs. leverage
. qui reghdfe intang_intensity ln_K_total_bs_rd ln_emp ln_age, ///
>     absorb(firm_id ano cae3) resid

. predict resid_intang_int, resid
(9 missing values generated)

. qui reghdfe leverage_assets_win, absorb(firm_id ano cae3) resid

. predict resid_leverage, resid

. 
. binscatter resid_intang_int resid_leverage, ///
>     nquantiles(20) ///
>     xtitle("Leverage, residualized") ///
>     ytitle("Intangible intensity, residualized") ///
>     title("Intangible Intensity and Financial Constraints") ///
>     note("Residuals from regression on firm, year and sector FE, log capital, log employment, log age.")

. graph export "$rootdir/results/fact2_intang_intensity_leverage.png", replace width(2000)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_intang_intensity_leverage.png
>  written in PNG format)

. 
. drop resid_intang_int resid_leverage

. 
. * R&D workers vs. leverage
. qui reghdfe share_rd_workers ln_K_total_bs_rd ln_emp ln_age if share_rd_workers > 0, ///
>     absorb(firm_id ano cae3) resid

. predict resid_rd_share, resid
(1,730,841 missing values generated)

. qui reghdfe leverage_assets_win if share_rd_workers > 0, ///
>     absorb(firm_id ano cae3) resid

. predict resid_leverage, resid
(1,730,841 missing values generated)

. 
. binscatter resid_rd_share resid_leverage if share_rd_workers > 0, ///
>     nquantiles(20) ///
>     xtitle("Leverage, residualized") ///
>     ytitle("Share of R&D workers, residualized") ///
>     title("R&D Labor Allocation and Financial Constraints") ///
>     note("Residuals from regression on firm, year and sector FE, log capital, log employment, log age." ///
>          "Sample: firms with positive R&D employment.")

. graph export "$rootdir/results/fact2_rd_workers_leverage.png", replace width(2000)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_rd_workers_leverage.png writt
> en in PNG format)

. 
. drop resid_rd_share resid_leverage

. 
. di "     ✓ Figures saved (4 binscatters)"
     ✓ Figures saved (4 binscatters)

. di ""


. 
. di "=========================================="
==========================================

. di "FACT 2 COMPLETE"
FACT 2 COMPLETE

. di "=========================================="
==========================================

. di ""


. di "Output files:"
Output files:

. di "  • fact2_physical_inv_leverage.png      - Physical investment vs leverage"
  • fact2_physical_inv_leverage.png      - Physical investment vs leverage

. di "  • fact2_intangible_inv_leverage.png    - Intangible investment vs leverage"
  • fact2_intangible_inv_leverage.png    - Intangible investment vs leverage

. di "  • fact2_intang_intensity_leverage.png  - Intangible intensity vs leverage"
  • fact2_intang_intensity_leverage.png  - Intangible intensity vs leverage

. di "  • fact2_rd_workers_leverage.png        - R&D workers vs leverage"
  • fact2_rd_workers_leverage.png        - R&D workers vs leverage

. di ""


. di "KEY RESULT:"
KEY RESULT:

. di "  Constrained firms (high leverage) have:"
  Constrained firms (high leverage) have:

. di "    → Lower intangible investment rate"
    → Lower intangible investment rate

. di "    → Lower intangible intensity"  
    → Lower intangible intensity

. di "    → Lower R&D worker allocation"
    → Lower R&D worker allocation

. di "  This is the pecking order distortion from low pledgeability of intangibles"
  This is the pecking order distortion from low pledgeability of intangibles

. di ""


. 
. /*==============================================================================
>    FACT 3: UNDEREXPLOITATION OF COMPLEMENTARITY BY CONSTRAINED FIRMS
>    
>    Theory: Financial constraints distort input choices, pushing firms away
>            from the region where the technological complementarity between
>            intangibles and skilled labor is operative.
> ==============================================================================*/
. 
. di "=========================================="
==========================================

. di "FACT 3: UNDEREXPLOITATION OF COMPLEMENTARITY"
FACT 3: UNDEREXPLOITATION OF COMPLEMENTARITY

. di "=========================================="
==========================================

. di ""


. 
. *------------------------------------------------------------------------------
. * Construct leverage-based constraint indicator
. *------------------------------------------------------------------------------
. 
. di "  → Constructing leverage-based constraint groups..."
  → Constructing leverage-based constraint groups...

. di ""


. 
. * Median leverage by year and sector
. bys ano cae3: egen lev_median = median(leverage_assets_win)

. 
. gen high_leverage = leverage_assets_win >= lev_median if !missing(leverage_assets_win)

. label var high_leverage "High leverage (above sector-year median)"

. 
. di "     ✓ Constraint indicator created"
     ✓ Constraint indicator created

. di ""


. 
. *------------------------------------------------------------------------------
. * Regression evidence: Build-up specification
. *------------------------------------------------------------------------------
. 
. di "  → Running complementarity regressions by constraint status..."
  → Running complementarity regressions by constraint status...

. di ""


. 
. eststo clear

. 
. * Column 1: Baseline (pooled)
. eststo col1: reghdfe ln_GVA ///
>     c.intang_intensity_bs_rd##c.share_skilled ///
>     ln_K_total_bs_rd ln_emp ln_age, ///
>     absorb(firm_id ano cae3) vce(robust)
(dropped 1 singleton observations)
(MWFE estimator converged in 52 iterations)

HDFE Linear regression                            Number of obs   =  1,759,076
Absorbing 3 HDFE groups                           F(   6,1502827) =   36353.81
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.8950
                                                  Adj R-squared   =     0.8771
                                                  Within R-sq.    =     0.2033
                                                  Root MSE        =     0.5128

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                                  ln_GVA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1253611   .0089436   -14.02   0.000    -.1428903    -.107832
                           share_skilled |  -.0154463   .0046469    -3.32   0.001    -.0245541   -.0063386
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0398381   .0174711     2.28   0.023     .0055953    .0740809
                                         |
                        ln_K_total_bs_rd |   .0901497   .0006737   133.81   0.000     .0888292    .0914702
                                  ln_emp |   .5461208   .0015443   353.64   0.000     .5430941    .5491476
                                  ln_age |   .3551492   .0024089   147.43   0.000     .3504279    .3598705
                                   _cons |   8.857374   .0089527   989.35   0.000     8.839827    8.874921
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     firm_id |    256151           0      256151     |
         ano |        12           1          11     |
        cae3 |        83           2          81    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. * Column 2: Low-leverage firms
. eststo col2: reghdfe ln_GVA ///
>     c.intang_intensity_bs_rd##c.share_skilled ///
>     ln_K_total_bs_rd ln_emp ln_age ///
>     if high_leverage == 0, ///
>     absorb(firm_id ano cae3) vce(robust)
(dropped 27319 singleton observations)
(MWFE estimator converged in 54 iterations)

HDFE Linear regression                            Number of obs   =    851,846
Absorbing 3 HDFE groups                           F(   6, 688614) =   13680.83
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9043
                                                  Adj R-squared   =     0.8816
                                                  Within R-sq.    =     0.1764
                                                  Root MSE        =     0.4941

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                                  ln_GVA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1349588   .0137005    -9.85   0.000    -.1618114   -.1081063
                           share_skilled |  -.0229444   .0068935    -3.33   0.001    -.0364553   -.0094334
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0551379   .0269186     2.05   0.041     .0023783    .1078976
                                         |
                        ln_K_total_bs_rd |   .0856955   .0010076    85.05   0.000     .0837206    .0876704
                                  ln_emp |   .5175192   .0023861   216.89   0.000     .5128425    .5221958
                                  ln_age |   .3496222   .0034059   102.65   0.000     .3429467    .3562977
                                   _cons |   8.974802   .0130836   685.96   0.000     8.949159    9.000446
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     firm_id |    163137           0      163137     |
         ano |        12           1          11     |
        cae3 |        81           3          78    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. * Column 3: High-leverage firms
. eststo col3: reghdfe ln_GVA ///
>     c.intang_intensity_bs_rd##c.share_skilled ///
>     ln_K_total_bs_rd ln_emp ln_age ///
>     if high_leverage == 1, ///
>     absorb(firm_id ano cae3) vce(robust)
(dropped 23039 singleton observations)
(MWFE estimator converged in 52 iterations)

HDFE Linear regression                            Number of obs   =    856,873
Absorbing 3 HDFE groups                           F(   6, 699231) =   16215.68
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9057
                                                  Adj R-squared   =     0.8845
                                                  Within R-sq.    =     0.1986
                                                  Root MSE        =     0.5035

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                                  ln_GVA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1176565     .01346    -8.74   0.000    -.1440377   -.0912753
                           share_skilled |  -.0102911    .007022    -1.47   0.143    -.0240541    .0034719
                                         |
c.intang_intensity_bs_rd#c.share_skilled |  -.0061285   .0258633    -0.24   0.813    -.0568196    .0445626
                                         |
                        ln_K_total_bs_rd |   .1032672   .0011278    91.57   0.000     .1010568    .1054776
                                  ln_emp |   .5342887   .0022884   233.48   0.000     .5298036    .5387739
                                  ln_age |   .4044085   .0041461    97.54   0.000     .3962823    .4125347
                                   _cons |   8.590481    .015591   550.99   0.000     8.559923    8.621038
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     firm_id |    157545           0      157545     |
         ano |        12           1          11     |
        cae3 |        83           3          80    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. *------------------------------------------------------------------------------
. * Export table
. *------------------------------------------------------------------------------
. 
. esttab col1 col2 col3 using "$rootdir/results/fact3_underexploitation.tex", replace ///
>     b(4) se(4) r2 star(* 0.10 ** 0.05 *** 0.01) ///
>     label booktabs ///
>     keep(intang_intensity_bs_rd share_skilled ///
>          c.intang_intensity_bs_rd#c.share_skilled ///
>          ln_K_total_bs_rd ln_emp ln_age) ///
>     order(intang_intensity_bs_rd share_skilled ///
>           c.intang_intensity_bs_rd#c.share_skilled ///
>           ln_K_total_bs_rd ln_emp ln_age) ///
>     stats(N r2, ///
>           labels("Observations" "Adjusted R-squared") ///
>           fmt(%12.0fc 3)) ///
>     title("Underexploitation of Intangibles–Skills Complementarity") ///
>     mtitles("All Firms" "Low Leverage" "High Leverage") ///
>     refcat(intang_intensity_bs_rd "\textit{Main effects:}" ///
>            c.intang_intensity_bs_rd#c.share_skilled "\textit{Complementarity:}" ///
>            ln_K_total_bs_rd "\textit{Controls:}", nolabel) ///
>     addnote("Dependent variable: Log gross value added (GVA)." ///
>             "Low- and high-leverage defined relative to sector-year median leverage." ///
>             "All specifications include year and industry fixed effects." ///
>             "Standard errors clustered at firm level.")
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_underexploitation.tex n
> ot found)
(output written to C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_underexploitatio
> n.tex)

. 
. di ""


. di "  ✓ Table saved: fact3_underexploitation.tex"
  ✓ Table saved: fact3_underexploitation.tex

. di ""


. 
. *------------------------------------------------------------------------------
. * Summary
. *------------------------------------------------------------------------------
. 
. di "=========================================="
==========================================

. di "FACT 3 COMPLETE"
FACT 3 COMPLETE

. di "=========================================="
==========================================

. di ""


. di "Output files:"
Output files:

. di "  • fact3_underexploitation.tex         - Regression evidence"
  • fact3_underexploitation.tex         - Regression evidence

. di ""


. di "KEY RESULT:"
KEY RESULT:

. di "  Complementarity between intangibles and skilled labor is:"
  Complementarity between intangibles and skilled labor is:

. di "    → Strong and significant for low-leverage firms"
    → Strong and significant for low-leverage firms

. di "    → Weaker or absent for high-leverage firms"
    → Weaker or absent for high-leverage firms

. di ""


. di "INTERPRETATION:"
INTERPRETATION:

. di "  Financial constraints distort input choices, pushing firms away"
  Financial constraints distort input choices, pushing firms away

. di "  from the region where technological complementarity is operative."
  from the region where technological complementarity is operative.

. di ""


. 
. 
. cap log close
