------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE\output\empirical_analysis.log
  log type:  text
 opened on:  14 Jan 2026, 14:10:59

. 
. use "final_data_2011_2022_analysis.dta", clear

. 
. xtset firm_id ano
       panel variable:  firm_id (unbalanced)
        time variable:  ano, 2011 to 2022, but with gaps
                delta:  1 unit

. 
. * Set white background for all graphs
. set scheme s1color

. 
. cap mkdir "$rootdir/results"

. 
. 
. /*==============================================================================
>    FACT 1: COMPLEMENTARITY BETWEEN INTANGIBLES AND SKILLED LABOR
> ==============================================================================*/
. 
. * Raw correlation
. preserve

. collapse (mean) intang_intensity_bs_rd share_skilled, by(firm_id)

. binscatter intang_intensity_bs_rd share_skilled, nquantiles(20) ///
>     xtitle("Share of Skilled Workers") ///
>     ytitle("Intangible Intensity (K_intangible / K_total)") ///
>     title("Intangibles and Skills: Raw Correlation")
warning: nquantiles(20) was specified, but only 10 were generated. see help file under nquantiles() for explanation.

. graph export "$rootdir/results/fact1_raw_correlation.png", replace width(2000)
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact1_raw_correlation.png not
>  found)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact1_raw_correlation.png written i
> n PNG format)

. restore

. 
. * Production function regressions
. eststo clear

. 
. eststo revenue: reghdfe ln_revenue c.intang_intensity_bs_rd##c.share_skilled ///
>     ln_K_total_bs_rd ln_emp ln_age, absorb(firm_id ano cae3) vce(robust)
(MWFE estimator converged in 52 iterations)

HDFE Linear regression                            Number of obs   =  1,759,084
Absorbing 3 HDFE groups                           F(   6,1502834) =   39240.25
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9518
                                                  Adj R-squared   =     0.9436
                                                  Within R-sq.    =     0.2767
                                                  Root MSE        =     0.3554

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                              ln_revenue |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1018422   .0064696   -15.74   0.000    -.1145223   -.0891621
                           share_skilled |  -.0127821   .0036421    -3.51   0.000    -.0199205   -.0056437
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0261977   .0136834     1.91   0.056    -.0006213    .0530166
                                         |
                        ln_K_total_bs_rd |    .087171   .0005329   163.59   0.000     .0861266    .0882154
                                  ln_emp |   .4485111   .0012561   357.06   0.000     .4460492    .4509731
                                  ln_age |   .3135366   .0017529   178.86   0.000     .3101009    .3169723
                                   _cons |   10.29652   .0070657  1457.25   0.000     10.28267    10.31037
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     firm_id |    256152           0      256152     |
         ano |        12           1          11     |
        cae3 |        83           2          81    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. eststo production: reghdfe ln_production c.intang_intensity_bs_rd##c.share_skilled ///
>     ln_K_total_bs_rd ln_emp ln_age, absorb(firm_id ano cae3) vce(robust)
(MWFE estimator converged in 52 iterations)

HDFE Linear regression                            Number of obs   =  1,759,084
Absorbing 3 HDFE groups                           F(   6,1502834) =   46124.00
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9513
                                                  Adj R-squared   =     0.9430
                                                  Within R-sq.    =     0.2993
                                                  Root MSE        =     0.3409

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                           ln_production |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1111231   .0061259   -18.14   0.000    -.1231296   -.0991165
                           share_skilled |  -.0083815   .0033361    -2.51   0.012    -.0149202   -.0018427
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0416667   .0125308     3.33   0.001     .0171067    .0662266
                                         |
                        ln_K_total_bs_rd |   .0911289   .0005005   182.09   0.000      .090148    .0921098
                                  ln_emp |   .4547085   .0011632   390.92   0.000     .4524287    .4569883
                                  ln_age |    .307833   .0016997   181.11   0.000     .3045017    .3111643
                                   _cons |   9.911814   .0067262  1473.60   0.000     9.898631    9.924997
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     firm_id |    256152           0      256152     |
         ano |        12           1          11     |
        cae3 |        83           2          81    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. eststo gva: reghdfe ln_GVA c.intang_intensity_bs_rd##c.share_skilled ///
>     ln_K_total_bs_rd ln_emp ln_age, absorb(firm_id ano cae3) vce(robust)
(dropped 1 singleton observations)
(MWFE estimator converged in 54 iterations)

HDFE Linear regression                            Number of obs   =  1,759,076
Absorbing 3 HDFE groups                           F(   6,1502827) =   36353.81
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.8950
                                                  Adj R-squared   =     0.8771
                                                  Within R-sq.    =     0.2033
                                                  Root MSE        =     0.5128

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                                  ln_GVA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1253611   .0089436   -14.02   0.000    -.1428903    -.107832
                           share_skilled |  -.0154463   .0046469    -3.32   0.001    -.0245541   -.0063386
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0398381   .0174711     2.28   0.023     .0055953    .0740809
                                         |
                        ln_K_total_bs_rd |   .0901497   .0006737   133.81   0.000     .0888292    .0914702
                                  ln_emp |   .5461208   .0015443   353.64   0.000     .5430941    .5491476
                                  ln_age |   .3551492   .0024089   147.43   0.000     .3504279    .3598705
                                   _cons |   8.857374   .0089527   989.35   0.000     8.839827    8.874921
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     firm_id |    256151           0      256151     |
         ano |        12           1          11     |
        cae3 |        83           2          81    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. esttab revenue production gva using "$rootdir/results/fact1_complementarity.tex", replace ///
>     b(4) se(4) r2 star(* 0.10 ** 0.05 *** 0.01) booktabs ///
>     drop(ln_K_total_bs_rd ln_emp ln_age _cons) ///
>     coeflabels(intang_intensity_bs_rd "Intangible Intensity" ///
>                share_skilled "Share Skilled Workers" ///
>                c.intang_intensity_bs_rd#c.share_skilled "Intangible Intensity $\times$ Share Skilled") ///
>     stats(N r2, labels("Observations" "Adjusted R-squared") fmt(%12.0fc 3)) ///
>     title("Complementarity Between Intangibles and Skilled Labor\label{tab:complementarity}") ///
>     mtitles("Revenue" "Production" "GVA") ///
>     nonotes ///
>     addnote("All output measures in logs. Intangible intensity = K$_{intangible}$ / K$_{total}$." ///
>             "All specifications include firm, year, and industry fixed effects." ///
>             "Robust standard errors in parentheses.")
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact1_complementarity.tex not
>  found)
(output written to C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact1_complementarity.
> tex)

. 
. 
. /*==============================================================================
>    FACT 2: FINANCIAL CONSTRAINTS AND THE PECKING ORDER
> ==============================================================================*/
. 
. * Winsorize variables for Fact 2
. winsor2 inv_rate_physical_bs_rd, cuts(5 95) by(ano cae3) suffix(_w)

. label var inv_rate_physical_bs_rd_w "Physical investment rate (winsorized 5-95)"

. 
. winsor2 inv_rate_intang_bs_rd, cuts(5 95) by(ano cae3) suffix(_w)

. label var inv_rate_intang_bs_rd_w "Intangible investment rate (winsorized 5-95)"

. 
. winsor2 leverage_assets, cuts(5 95) by(ano cae3) suffix(_w)

. label var leverage_assets_w "Leverage (Debt/Assets, winsorized 5-95)"

. 
. * Define leverage constraint (sector-year median)
. bysort cae3 ano: egen leverage_median = median(leverage_assets_w)

. gen high_leverage = (leverage_assets_w > leverage_median) if !missing(leverage_assets_w, leverage_median)

. label var high_leverage "Above sector-year median leverage"

. 
. * Residualized binscatters
. foreach var in inv_rate_physical_bs_rd_w inv_rate_intang_bs_rd_w intang_intensity_bs_rd {
  2.     qui reghdfe `var' ln_K_total_bs_rd ln_emp ln_age, absorb(firm_id ano cae3) resid
  3.     predict resid_`var', resid
  4. }
(383,466 missing values generated)
(383,497 missing values generated)
(9 missing values generated)

. 
. * Physical investment vs leverage
. binscatter resid_inv_rate_physical_bs_rd_w leverage_assets_w, nquantiles(20) ///
>     xtitle("Leverage (Debt / Assets)") ytitle("Physical Investment Rate (residualized)") ///
>     title("Physical Investment and Leverage")
warning: nquantiles(20) was specified, but only 16 were generated. see help file under nquantiles() for explanation.

. graph export "$rootdir/results/fact2_physical_inv_leverage.png", replace width(2000)
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_physical_inv_leverage.p
> ng not found)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_physical_inv_leverage.png wri
> tten in PNG format)

. 
. * Intangible investment vs leverage
. binscatter resid_inv_rate_intang_bs_rd_w leverage_assets_w, nquantiles(20) ///
>     xtitle("Leverage (Debt / Assets)") ytitle("Intangible Investment Rate (residualized)") ///
>     title("Intangible Investment and Leverage")
warning: nquantiles(20) was specified, but only 16 were generated. see help file under nquantiles() for explanation.

. graph export "$rootdir/results/fact2_intangible_inv_leverage.png", replace width(2000)
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_intangible_inv_leverage
> .png not found)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_intangible_inv_leverage.png w
> ritten in PNG format)

. 
. * Intangible intensity vs leverage
. binscatter resid_intang_intensity_bs_rd leverage_assets_w, nquantiles(20) ///
>     xtitle("Leverage (Debt / Assets)") ytitle("Intangible Intensity (residualized)") ///
>     title("Intangible Intensity and Leverage")
warning: nquantiles(20) was specified, but only 16 were generated. see help file under nquantiles() for explanation.

. graph export "$rootdir/results/fact2_intang_intensity_leverage.png", replace width(2000)
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_intang_intensity_levera
> ge.png not found)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_intang_intensity_leverage.png
>  written in PNG format)

. 
. * R&D workers vs leverage
. preserve

. keep if share_rd_workers > 0
(1,729,074 observations deleted)

. qui reghdfe share_rd_workers ln_K_total_bs_rd ln_emp ln_age, absorb(firm_id ano cae3) resid

. predict resid_rd_workers, resid
(1,767 missing values generated)

. binscatter resid_rd_workers leverage_assets_w, nquantiles(20) ///
>     xtitle("Leverage (Debt / Assets)") ytitle("Share of R&D Workers (residualized)") ///
>     title("R&D Employment and Leverage")
warning: nquantiles(20) was specified, but only 19 were generated. see help file under nquantiles() for explanation.

. graph export "$rootdir/results/fact2_rd_workers_leverage.png", replace width(2000)
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_rd_workers_leverage.png
>  not found)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact2_rd_workers_leverage.png writt
> en in PNG format)

. restore

. 
. drop resid_* 

. 
. 
. /*==============================================================================
>    FACT 3: UNDEREXPLOITATION OF COMPLEMENTARITY BY CONSTRAINED FIRMS
> ==============================================================================*/
. 
. * Cross-sectional evidence: Complementarity by leverage group
. eststo clear

. 
. eststo pooled: reghdfe ln_GVA c.intang_intensity_bs_rd##c.share_skilled ///
>     ln_K_total_bs_rd ln_emp ln_age, absorb(firm_id ano cae3) vce(robust)
(dropped 1 singleton observations)
(MWFE estimator converged in 52 iterations)

HDFE Linear regression                            Number of obs   =  1,759,076
Absorbing 3 HDFE groups                           F(   6,1502827) =   36353.81
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.8950
                                                  Adj R-squared   =     0.8771
                                                  Within R-sq.    =     0.2033
                                                  Root MSE        =     0.5128

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                                  ln_GVA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1253611   .0089436   -14.02   0.000    -.1428903    -.107832
                           share_skilled |  -.0154463   .0046469    -3.32   0.001    -.0245541   -.0063386
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0398381   .0174711     2.28   0.023     .0055953    .0740809
                                         |
                        ln_K_total_bs_rd |   .0901497   .0006737   133.81   0.000     .0888292    .0914702
                                  ln_emp |   .5461208   .0015443   353.64   0.000     .5430941    .5491476
                                  ln_age |   .3551492   .0024089   147.43   0.000     .3504279    .3598705
                                   _cons |   8.857374   .0089527   989.35   0.000     8.839827    8.874921
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     firm_id |    256151           0      256151     |
         ano |        12           1          11     |
        cae3 |        83           2          81    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. eststo low_lev: reghdfe ln_GVA c.intang_intensity_bs_rd##c.share_skilled ///
>     ln_K_total_bs_rd ln_emp ln_age if high_leverage == 0, ///
>     absorb(firm_id ano cae3) vce(robust)
(dropped 27288 singleton observations)
(MWFE estimator converged in 53 iterations)

HDFE Linear regression                            Number of obs   =    852,524
Absorbing 3 HDFE groups                           F(   6, 689189) =   13692.23
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9044
                                                  Adj R-squared   =     0.8817
                                                  Within R-sq.    =     0.1764
                                                  Root MSE        =     0.4941

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                                  ln_GVA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1342486   .0137132    -9.79   0.000    -.1611261   -.1073712
                           share_skilled |  -.0229511   .0068925    -3.33   0.001    -.0364603   -.0094419
                                         |
c.intang_intensity_bs_rd#c.share_skilled |   .0556479   .0269266     2.07   0.039     .0028725    .1084232
                                         |
                        ln_K_total_bs_rd |   .0857632   .0010074    85.14   0.000     .0837888    .0877376
                                  ln_emp |   .5173955   .0023849   216.95   0.000     .5127212    .5220699
                                  ln_age |   .3495847   .0034047   102.68   0.000     .3429117    .3562578
                                   _cons |   8.974522    .013081   686.07   0.000     8.948883     9.00016
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     firm_id |    163238           0      163238     |
         ano |        12           1          11     |
        cae3 |        83           3          80    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. eststo high_lev: reghdfe ln_GVA c.intang_intensity_bs_rd##c.share_skilled ///
>     ln_K_total_bs_rd ln_emp ln_age if high_leverage == 1, ///
>     absorb(firm_id ano cae3) vce(robust)
(dropped 23026 singleton observations)
(MWFE estimator converged in 48 iterations)

HDFE Linear regression                            Number of obs   =    856,239
Absorbing 3 HDFE groups                           F(   6, 698685) =   16201.78
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.9057
                                                  Adj R-squared   =     0.8844
                                                  Within R-sq.    =     0.1987
                                                  Root MSE        =     0.5035

----------------------------------------------------------------------------------------------------------
                                         |               Robust
                                  ln_GVA |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------------------+----------------------------------------------------------------
                  intang_intensity_bs_rd |  -.1182742   .0134693    -8.78   0.000    -.1446737   -.0918748
                           share_skilled |  -.0101643   .0070252    -1.45   0.148    -.0239335    .0036048
                                         |
c.intang_intensity_bs_rd#c.share_skilled |  -.0051152   .0258773    -0.20   0.843    -.0558339    .0456034
                                         |
                        ln_K_total_bs_rd |   .1032162   .0011278    91.52   0.000     .1010056    .1054267
                                  ln_emp |   .5344132   .0022894   233.43   0.000     .5299261    .5389003
                                  ln_age |   .4045296   .0041488    97.50   0.000      .396398    .4126612
                                   _cons |   8.590374   .0155967   550.78   0.000     8.559805    8.620943
----------------------------------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     firm_id |    157458           0      157458     |
         ano |        12           1          11     |
        cae3 |        81           2          79    ?|
-----------------------------------------------------+
? = number of redundant parameters may be higher

. 
. esttab pooled low_lev high_lev using "$rootdir/results/fact3_underexploitation.tex", replace ///
>     b(4) se(4) r2 star(* 0.10 ** 0.05 *** 0.01) booktabs ///
>     drop(ln_K_total_bs_rd ln_emp ln_age _cons) ///
>     coeflabels(intang_intensity_bs_rd "Intangible Intensity" ///
>                share_skilled "Share Skilled Workers" ///
>                c.intang_intensity_bs_rd#c.share_skilled "Intangible Intensity $\times$ Share Skilled") ///
>     stats(N r2, labels("Observations" "Adjusted R-squared") fmt(%12.0fc 3)) ///
>     title("Underexploitation of Intangibles--Skills Complementarity\label{tab:underexploitation}") ///
>     mtitles("All Firms" "Low Leverage" "High Leverage") ///
>     refcat(intang_intensity_bs_rd "\textit{Main effects:}" ///
>            c.intang_intensity_bs_rd#c.share_skilled "\textit{Complementarity:}", nolabel) ///
>     nonotes ///
>     addnote("Dependent variable: Log gross value added (GVA)." ///
>             "Low- and high-leverage defined relative to sector-year median leverage." ///
>             "All specifications include firm and year $\times$ industry fixed effects." ///
>             "Robust standard errors in parentheses.")
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_underexploitation.tex n
> ot found)
(output written to C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_underexploitatio
> n.tex)

. 
. * Dynamic evidence: Wage premium and skill share evolution (2011-2022)
. gen wage_premium = avg_wage_skilled / avg_wage_unskilled if avg_wage_skilled > 0 & avg_wage_unskilled > 0
(1,226,100 missing values generated)

. label var wage_premium "Wage premium (skilled/unskilled)"

. 
. * Residualize to control for size/age/industry (not year FE, to preserve time trends)
. * This abstracts from selection effects (e.g., larger firms having different skill composition)
. qui reghdfe share_skilled ln_K_total_bs_rd ln_emp ln_age, absorb(cae3) resid

. predict resid_share_skilled, resid
(9 missing values generated)

. 
. qui reghdfe wage_premium ln_K_total_bs_rd ln_emp ln_age, absorb(cae3) resid

. predict resid_wage_premium, resid
(1,226,100 missing values generated)

. 
. preserve

. 
. * Aggregate trends (raw, for reference)
. collapse (mean) share_skilled wage_premium, by(ano)

. 
. twoway (connected share_skilled ano, yaxis(1) lcolor(navy) mcolor(navy) msymbol(O) ///
>         ytitle("Share of Skilled Workers", axis(1))) ///
>        (connected wage_premium ano, yaxis(2) lcolor(cranberry) mcolor(cranberry) msymbol(D) ///
>         ytitle("Wage Premium (Skilled/Unskilled)", axis(2))), ///
>     xlabel(2011(2)2022) xtitle("") ///
>     legend(order(1 "Share Skilled (left)" 2 "Wage Premium (right)") pos(6) rows(1)) ///
>     title("Skill Supply Shock and Declining Wage Premium")

. graph export "$rootdir/results/fact3_skill_premium_trends.png", replace width(2000)
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_skill_premium_trends.pn
> g not found)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_skill_premium_trends.png writ
> ten in PNG format)

. 
. restore

. 
. * Share of skilled workers by leverage (residualized)
. preserve

. 
. collapse (mean) resid_share_skilled, by(ano high_leverage)

. reshape wide resid_share_skilled, i(ano) j(high_leverage)
(note: j = 0 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       24   ->      12
Number of variables                   3   ->       3
j variable (2 values)     high_leverage   ->   (dropped)
xij variables:
                    resid_share_skilled   ->   resid_share_skilled0 resid_share_skilled1
-----------------------------------------------------------------------------

. 
. twoway (connected resid_share_skilled0 ano, lcolor(forest_green) mcolor(forest_green) msymbol(O) lwidth(medium)) ///
>        (connected resid_share_skilled1 ano, lcolor(maroon) mcolor(maroon) msymbol(D) lwidth(medium)), ///
>     xlabel(2011(2)2022) xtitle("") ylabel(, format(%4.3f)) ///
>     ytitle("Share of Skilled Workers (residualized)") ///
>     legend(order(1 "Low Leverage" 2 "High Leverage") pos(6) rows(1)) ///
>     title("Skill Share by Leverage Status")

. graph export "$rootdir/results/fact3_skills_by_leverage.png", replace width(2000)
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_skills_by_leverage.png 
> not found)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_skills_by_leverage.png writte
> n in PNG format)

. 
. restore

. 
. * Wage premium trends by leverage (residualized)
. preserve

. 
. collapse (mean) resid_wage_premium, by(ano high_leverage)

. reshape wide resid_wage_premium, i(ano) j(high_leverage)
(note: j = 0 1)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       24   ->      12
Number of variables                   3   ->       3
j variable (2 values)     high_leverage   ->   (dropped)
xij variables:
                     resid_wage_premium   ->   resid_wage_premium0 resid_wage_premium1
-----------------------------------------------------------------------------

. 
. twoway (connected resid_wage_premium0 ano, lcolor(forest_green) mcolor(forest_green) msymbol(O) lwidth(medium)) ///
>        (connected resid_wage_premium1 ano, lcolor(maroon) mcolor(maroon) msymbol(D) lwidth(medium)), ///
>     xlabel(2011(2)2022) xtitle("") ylabel(, format(%4.2f)) ///
>     ytitle("Wage Premium (residualized)") ///
>     legend(order(1 "Low Leverage" 2 "High Leverage") pos(6) rows(1)) ///
>     title("Wage Premium Decline: Driven by Constrained Firms")

. graph export "$rootdir/results/fact3_premium_by_leverage.png", replace width(2000)
(note: file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_premium_by_leverage.png
>  not found)
(file C:\Users\alexv\OneDrive\Documentos\3-Papers\Intangible_skill_Vicente\QP_SCIE/results/fact3_premium_by_leverage.png writt
> en in PNG format)

. 
. restore

. 
. drop resid_share_skilled resid_wage_premium

. 
. cap log close
